#### Terraform fmt for main `success`
#### Terraform init for main `success`
#### Terraform validate for main `success`
#### Terraform plan for main `success`

<details><summary>Show plan result for main </summary>

```

provision
random_password.vm_password: Refreshing state... [id=none]
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=110]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.debian_12_cloud_image will be created
  + resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {
      + content_type   = "iso"
      + datastore_id   = "local"
      + file_name      = "debian_12_cloud_image.img"
      + id             = (known after apply)
      + node_name      = "pve"
      + overwrite      = true
      + size           = (known after apply)
      + upload_timeout = 600
      + url            = "https://cloud.debian.org/images/cloud/bookworm/latest/debian-12-generic-amd64.qcow2"
      + verify         = true
    }

  # proxmox_virtual_environment_vm.debian_vm will be created
  + resource "proxmox_virtual_environment_vm" "debian_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "main"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 110

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-zfs"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 650
          + ssd               = true
        }

      + initialization {
          + datastore_id = "local-zfs"

          + dns {
              + servers = [
                  + "192.168.10.1",
                ]
            }

          + ip_config {
              + ipv4 {
                  + address = "192.168.10.110/24"
                  + gateway = "192.168.10.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ecdsa-sha2-nistp521 AAAAE2VjZHNhLXNoYTItbmlzdHA1MjEAAAAIbmlzdHA1MjEAAACFBAEC7fki9UNyuFGcNNeAOGCbUXxf/w+JGkKp7BR68gMTNmMYBE4/x+naDqJgajJElPuAYJaI715XBgKAOg+gwce2vwB9+XzRPCClEo6zZB56HugAVpnkje9PpdYJS6tattzD/56ofFDQltXVdYAuE49eOBNoyiD9I9y20inXkVJuEg5PCw==",
                ]
              + password = (sensitive value)
              + username = "devops"
            }
        }

      + memory {
          + dedicated = 8000
          + floating  = 0
          + shared    = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 10
        }

      + serial_device {
          + device = "socket"
        }
    }

  # proxmox_virtual_environment_vm.dev_vm will be destroyed
  # (because proxmox_virtual_environment_vm.dev_vm is not in configuration)
  - resource "proxmox_virtual_environment_vm" "dev_vm" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - id                      = "110" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "BC:24:11:69:8C:71",
        ] -> null
      - migrate                 = false -> null
      - name                    = "main" -> null
      - network_interface_names = [] -> null
      - node_name               = "pve" -> null
      - on_boot                 = true -> null
      - reboot                  = false -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = true -> null
      - tablet_device           = true -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 110 -> null

      - clone {
          - full    = true -> null
          - retries = 1 -> null
          - vm_id   = 999 -> null
        }

      - cpu {
          - architecture = "x86_64" -> null
          - cores        = 4 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "host" -> null
          - units        = 1024 -> null
        }

      - disk {
          - cache             = "none" -> null
          - datastore_id      = "local-zfs" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-110-disk-0" -> null
          - size              = 650 -> null
          - ssd               = false -> null
        }

      - initialization {
          - datastore_id = "local-zfs" -> null
          - interface    = "ide2" -> null

          - dns {
              - server  = "192.168.10.1" -> null
              - servers = [] -> null
            }

          - ip_config {
              - ipv4 {
                  - address = "192.168.10.110/24" -> null
                  - gateway = "192.168.10.1" -> null
                }
            }

          - user_account {
              - keys     = [
                  - "ecdsa-sha2-nistp521 AAAAE2VjZHNhLXNoYTItbmlzdHA1MjEAAAAIbmlzdHA1MjEAAACFBAEC7fki9UNyuFGcNNeAOGCbUXxf/w+JGkKp7BR68gMTNmMYBE4/x+naDqJgajJElPuAYJaI715XBgKAOg+gwce2vwB9+XzRPCClEo6zZB56HugAVpnkje9PpdYJS6tattzD/56ofFDQltXVdYAuE49eOBNoyiD9I9y20inXkVJuEg5PCw==",
                ] -> null
              - password = (sensitive value) -> null
              - username = "devops" -> null
            }
        }

      - memory {
          - dedicated = 8000 -> null
          - floating  = 0 -> null
          - shared    = 0 -> null
        }

      - network_device {
          - bridge      = "vmbr0" -> null
          - enabled     = true -> null
          - firewall    = false -> null
          - mac_address = "BC:24:11:69:8C:71" -> null
          - model       = "virtio" -> null
          - mtu         = 0 -> null
          - queues      = 0 -> null
          - rate_limit  = 0 -> null
          - vlan_id     = 10 -> null
        }

      - serial_device {
          - device = "socket" -> null
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*